const quizData = [
    {
        intro: "Так сейчас будет небольшой опросик. Я буду задавать вопросы и в зависимости от твоих ответов будут начисляться баллы. И потом узнаем результат или не узнаем. Это зависит от моего настроения.",
        question: "Начнём с козырей. Самый главный вопрос: ананасы на пицце — это еда богов или преступление против человечества?",
        options: [
            { text: "Еда богов", points: 3 },
            { text: "Преступление", points: -1.5 }
        ]
    },
    {
        intro: "Продолжим про пиццу.",
        question: "Ты корки от пиццы: съедаешь или оставляешь?",
        options: [
            { text: "Съедаешь", points: 3 },
            { text: "Оставляешь", points: -1.5 }
        ]
    },
    {
        intro: "Так идём дальше.",
        question: "Ты из тех, кто ставит 10 будильников с интервалом в 5 минут, или встаёшь с первого раза?",
        options: [
            { text: "С первого раза", points: 3 },
            { text: "10 будильников", points: -1.5 }
        ]
    },
    {
        intro: "Мг... записал. Так идём дальше.",
        question: "Сначала молоко, потом хлопья, или наоборот?",
        options: [
            { text: "Любой ответ (+2.5 балла)", points: 2.5 }
        ]
    },
    {
        intro: "И послдений вопрос в этой части.",
        question: "Попкорн: сладкий или солёный?",
        options: [
            { text: "Сладкий / Солёный", points: 1.5 },
            { text: "Другой", points: 3 }
        ]
    }
];

const extraTopics = [
    {
        intro: "Перейдём ко второй части интервью.",
        question: "Если бы прям сейчас начался зондре-апокалиптик, как думаешь, кто из нас троих первым бы... нууу... умер насмерть?",
        note: ""
    },
    {
        question: "Какую суперспособность ты бы выбрала и почему?",
        note: "Можешь придумать что угодно. Даже превращаться в Мадуро."
    },
    {
        question: "Самая странная вещь, которую ты заметила в Максе?",
        note: ""
    },
    {
        intro: "Назови рандомное число от 1 до 37... Так это будет моим числом.",
        question: "На сколько по 66-балльной шкале Макс душнила?",
        note: "Пу-пу-пу. Так, ладно, тогда назови своё любимое число."
    },
    {
        intro: "",
        question: "Какое самое бесполезное знание или навык у тебя есть?",
        note: "Ну, типа, умеешь шевелить ушами или знаешь когда родился Мадуро?"
    },
    {
        intro: "",
        question: "У тебя есть какая-то фобия?",
        note: "Ну там, клоуны или боязнь высоты? Я вот, например, ничего не боюсь. Да и вообще я самый лучший ever."
    },
    {
        intro: "Перед ответом на следующий вопрос, я советую подумать. Verstehen (Ферштейн)?",
        question: "Твоя любимая порода собак.",
        note: "Ну ладно, а котов?.. Если кому-то интересно, то моя Манчкины."
    },
    {
        intro: "А сейчас вопрос, ответ на который мне даст полное понимание твоего психологического портрета.",
        question: "Что у тебя сейчас в рекомендациях ТикТока?",
        note: "Котики, тарологи, новости, рецепты или какая-то трендовая дичь? Ну или... Мопсы?"
    },
    {
        intro: "Такой внезапный вопрос, ответ на который вы 100% знаете.",
        question: "Кто из вас дольше дышит под водой?",
        note: ""
    },
    {
        intro: "Мг-мг, ясно. Так, как ты счиатешь...",
        question: "...есть ли у тебя шанс... против меня 1 vs 1 на миду на Ченах?",
        note: "Ладно, это шутка, joke. Understood?"
    },
    {
        intro: "Мне такой вопрос не нравится, т.к. у меня на него всегда 1 ответ, но всёже.",
        question: "Кем ты себя видешь через условные 42 года?",
        note: "42 БРАТУХА 42"
    },
    {
        intro: "Ну и, наверное, последний вопрос.",
        question: "Есть ли у тебе плейлитсы песен? Если да, то скидывай их мне. Я как експерт в области всего, так уж и быть, смогу дать экспертную оценку.",
        note: "Свой плелист не скидывать!!!"
    }
];

const verdicts = [
    "✨ Человек, которому можно доверить кота ✨ (Мадуро)",
    "🕵️ Скрытый агент спецслужб 🕵️ (Мадуро)",
    "🦖 Потенциальный захватчик мира (в скобочках Мадуро (ещё скобочки. то что в первых скобочках не произносить)) 🦖",
    "👽 Гость с планеты Мадуро 👽",
    "🧘‍♀️ Магистр спокойствия и адекватности 🧘‍♀️ (Мадуро)",
    "🌪 Ходячий хаос, чтобы это не значило 🌪",
    "🤡 Президент клуба любителей странных шуток 🤡 (любителей Мадуро)",
    "🥇 Чемпион мира по Мадуро 🥇",
    "😼 Злой злодей 😼 (Мадуро)",
    "🧩 Мадуро 🧩"
];

const situations = [
    {
        situation: "Если спросили: \"Как к тебе обращаться?\"",
        replica: "Конечно на ВЫ, это же очевидно. А если серьёзно, то у меня много имён. Люди называют меня по разному: хозяин, всемогущий, босс. Но почему-то только одно прозвище стало очень популярным, наверное из-за того что оно короткое и скоромное - БОГ.",
        isGold: true
    }
];


let totalScore = 0;

window.onload = function() {
    const feed1 = document.getElementById('part-one-feed');
    const feed2 = document.getElementById('part-two-feed');
    const feedEmergency = document.getElementById('emergency-feed');
    
    feed1.innerHTML += `<div class="section-title">↓ Часть 1: Опрос на баллы ↓</div>`;
    quizData.forEach((item, index) => {
        let html = `<div class="script-card">`;
        if (item.intro) {
            html += `
            <div class="host-replica">
                <strong><i class='bx bx-user-voice'></i> Моя реплика:</strong>
                "${item.intro}"
            </div>`;
        }
        html += `<h3>${index + 1}. ${item.question}</h3>`;
        html += `<div class="options-row">`;
        item.options.forEach(opt => {
            html += `<button class="opt-btn" onclick="addScore(this, ${opt.points})">${opt.text}</button>`;
        });
        html += `</div></div>`;
        feed1.innerHTML += html;
    });

    feed2.innerHTML += `<div class="section-title">↓ Часть 2: Более серьёзные вопросы ↓</div>`;
    extraTopics.forEach((item) => {
        let html = `<div class="script-card">`;
        if (item.intro) {
            html += `
            <div class="host-replica">
                <strong><i class='bx bx-user-voice'></i> Моя реплика:</strong>
                "${item.intro}"
            </div>`;
        }
        html += `<h3>${item.question}</h3>`;
        if (item.note) {
            html += `<span class="note">Подсказка: ${item.note}</span>`;
        }
        html += `</div>`;
        feed2.innerHTML += html;
    });

    feedEmergency.innerHTML += `<div class="section-title" style="color: #e6b333;">↓ Шпаргалка на всякий случай ↓</div>`;
    situations.forEach((item) => {
        let borderColor = item.isGold ? "#e6b333" : "#f0f0f0";
        let bgColor = item.isGold ? "#fffde7" : "#fff0f3";
        let icon = item.isGold ? "bxs-crown" : "bx-user-voice";
        
        let html = `<div class="script-card" style="border: 2px solid ${borderColor};">`;
        
        html += `<h3 style="color:${borderColor}">${item.situation}</h3>`;
        
        html += `
            <div class="host-replica" style="background: ${bgColor}; border-left: 5px solid ${borderColor};">
                <strong style="color:${borderColor}"><i class='bx ${icon}'></i> Твоя реплика:</strong>
                "${item.replica}"
            </div>`;
        
        html += `</div>`;
        feedEmergency.innerHTML += html;
    });
};

function addScore(btn, points) {
    let parent = btn.parentElement;
    let buttons = parent.getElementsByClassName('opt-btn');
    for (let b of buttons) {
        b.classList.remove('selected');
        b.disabled = true; 
        b.style.opacity = "0.5";
    }
    btn.classList.add('selected');
    btn.style.opacity = "1";
    
    totalScore += points;
    document.getElementById('score-value').innerText = totalScore;
}

function showVerdict() {
    const randomVerdict = verdicts[Math.floor(Math.random() * verdicts.length)];
    const verdictDiv = document.getElementById('final-verdict');
    const header = document.getElementById('sticky-header');
    
    header.style.display = 'none';

    verdictDiv.innerText = randomVerdict;
    verdictDiv.classList.remove('hidden');
    verdictDiv.scrollIntoView({behavior: "smooth", block: "center"});
}