// Структура: "ГОД-МЕСЯЦ": { income: ..., weeks: { 1: ..., 2: ... } }
const database = {
    "2026-02": {
        // Доход: fix - стипендия/зп, extra - подарки
        income: { fix: 7643, extra: 0 },
        
        // Траты по неделям. Просто пиши сумму. Можно использовать сложение (50 + 20).
        weeks: {
            1: {
                food: 125.56 + 26.99,
                snacks: 200.07 + 242.95,
                services: 34.16,
                games: 0,
                other: 0
            },
            2: {

            },
            3: {},
            4: {},
            5: {}
        }
    },

    "2026-03": {
            income: { fix: 7643, extra: 0 },
            
            weeks: {
                1: {
                    food: 0,
                    snacks: 0,
                    services: 0,
                    games: 0,
                    other: 0
                },
                2: {},
                3: {},
                4: {},
                5: {}
            }
        }
};